tap "dart-lang/dart"
tap "ddev/ddev"
tap "felixkratz/formulae"
tap "koekeishiya/formulae"
tap "nikitabobko/tap"
tap "sikarugir-app/sikarugir"
tap "zegervdv/zathura"
brew "fontconfig"
brew "glib"
brew "gdk-pixbuf"
brew "pango"
brew "librsvg"
brew "adwaita-icon-theme"
brew "ansible"
brew "jpeg-xl"
brew "aom"
brew "dbus"
brew "bat"
brew "btop"
brew "pkgconf"
brew "libavif"
brew "chafa"
brew "cloc"
brew "cmatrix"
brew "enchant"
brew "unbound"
brew "gnutls"
brew "sdl2"
brew "ffmpeg"
brew "fzf"
brew "gcc@13"
brew "gh"
brew "ghostscript"
brew "glow"
brew "libassuan"
brew "pinentry"
brew "gnupg"
brew "gpgme"
brew "openjdk"
brew "gradle"
brew "graphviz"
brew "grpc"
brew "gsettings-desktop-schemas"
brew "gtk+3"
brew "gspell"
brew "icu4c@76"
brew "python@3.13"
brew "gtk-mac-integration"
brew "gtk4"
brew "node"
brew "gtop"
brew "libheif"
brew "python@3.12"
brew "imagemagick"
brew "libhandy"
brew "llvm"
brew "luarocks"
brew "mariadb", restart_service: :changed
brew "markdownlint-cli"
brew "neofetch"
brew "neovim"
brew "nmap"
brew "opencv"
brew "openjdk@17"
brew "pandoc"
brew "pandoc-crossref"
brew "pass"
brew "poppler"
brew "portaudio"
brew "py3cairo"
brew "pyenv"
brew "pyenv-virtualenv"
brew "rename"
brew "ripgrep"
brew "scdoc"
brew "scipy"
brew "sdl2_image"
brew "sdl2_ttf"
brew "shellcheck"
brew "socat"
brew "stow"
brew "tectonic"
brew "tlrc"
brew "tmux"
brew "tree-sitter"
brew "tree-sitter-cli"
brew "vte3"
brew "wget"
brew "yarn"
brew "yazi"
brew "dart-lang/dart/dart"
brew "ddev/ddev/ddev"
brew "felixkratz/formulae/borders"
brew "felixkratz/formulae/sketchybar"
brew "zegervdv/zathura/zathura"
brew "zegervdv/zathura/zathura-pdf-mupdf"
cask "nikitabobko/tap/aerospace"
cask "claude-code"
cask "discord"
cask "docker-desktop"
cask "firefox"
cask "ghostty"
cask "gimp"
cask "katalon-studio"
cask "mactex"
cask "marta"
cask "monitorcontrol"
cask "nordvpn"
cask "roblox"
cask "sikarugir-app/sikarugir/sikarugir"
cask "sioyek"
cask "skim"
cask "steam"
cask "visual-studio-code"
vscode "docker.docker"
vscode "esbenp.prettier-vscode"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "llvm-vs-code-extensions.lldb-dap"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "mtxr.sqltools"
vscode "mtxr.sqltools-driver-mysql"
vscode "mvllow.rose-pine"
vscode "postman.postman-for-vscode"
vscode "redhat.java"
vscode "rust-lang.rust-analyzer"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vmware.vscode-boot-dev-pack"
vscode "vmware.vscode-spring-boot"
vscode "vscjava.migrate-java-to-azure"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-java-upgrade"
vscode "vscjava.vscode-maven"
vscode "vscjava.vscode-spring-boot-dashboard"
vscode "vscjava.vscode-spring-initializr"
vscode "vscodevim.vim"
cargo "cargo-generate"
cargo "mini-redis"
cargo "wasm-pack"
cargo "workshop-runner"
